app/Controllers/Dosen.php

    public function index()
    {
        $keyword= $this->request->getPost('keyword');
        if($keyword){
            $model =  $this->dosen->searchDataMhs($keyword);
        }else{
            $model =  $this->dosen;
        };

        $data = [
            'dosen'     => $model->getDosen()->paginate(10, 'dosen'),
            'pager'         => $model->pager,
            'breadcrumbs'   => "List Dosen",
            'title'         => "List Dosen | Hela Quiz",
            'addNewButton'  => "Tambah Dosen",
            'content'       => "pages/Dosen"
        ];
---
SELECT *
FROM `dosen`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `dosen`