app/Controllers/Jadwal.php

SELECT *
FROM `jadwal`
LEFT JOIN `dosen` ON `dosenID` = `dosenJID`
LEFT JOIN `matkul` ON `matKulID` = `matkulJID`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `jadwal`
LEFT JOIN `dosen` ON `dosenID` = `dosenJID`
LEFT JOIN `matkul` ON `matKulID` = `matkulJID`
---
    public function index()
    {
        $keyword= $this->request->getPost('keyword');
        if($keyword){
            $model =  $this->jadwal->searchDataJadwal($keyword);
        }else{
            $model =  $this->jadwal;
        };

        $data = [
            'jadwal'        => $model->getJadwal()->paginate(10, 'jadwal'),
            'pager'         => $model->pager,
            'dosen'         => $model->getDosen()->getResult(),
            'matkul'        => $model->getMatkul()->getResult(),
            'breadcrumbs'   => "List Jadwal",
            'title'         => "List Jadwal | Jacky Quiz",
            'addNewButton'  => "Tambah Jadwal",
            'content'       => "pages/Jadwal"
        ];