app/Models/MDosen.php

SELECT *
FROM `dosen`
ORDER BY `dosenID` DESC
---
    public function getDosen($id = false){
        if ($id === false){
            return $this->table('dosen')->orderBy('dosenID', 'DESC')->get();

SELECT *
FROM `matkul`
---
    public function getMatkul(){
        $query = $this->db->table('matkul');
        return $query->get();

INSERT INTO `dosen` (`dosenCode`, `dosenName`, `dosenSex`, `dosenPhone`, `dosenAddress`) VALUES ('2131002', 'tobi', 'laki-laki', '082233558899', 'awdawdaw')
---
    public function newDosen($data){
        $query = $this->db->table('dosen')->insert($data);