app/Models/MJadwal.php

    public function getDosen(){
        $query = $this->db->table('dosen');
        return $query->get();
---
SELECT *
FROM `dosen`

    public function getMatkul(){
        $query = $this->db->table('matkul');
        return $query->get();
---
SELECT *
FROM `matkul`

    public function newJadwal($data){
        $query = $this->db->table('jadwal')->insert($data);
---
INSERT INTO `jadwal` (`dosenJID`, `matKulJID`, `jadwalDay`, `jadwalDate`, `jadwalTime`) VALUES ('5', '2', 'Minggu', '2022-12-17', '06:28')

    public function updateJadwal($data, $id){
        $query = $this->db->table('jadwal')->update($data, array('jadwalID' => $id));
---
UPDATE `jadwal` SET `dosenJID` = '3', `matKulJID` = '2', `jadwalDay` = 'Senin', `jadwalDate` = '2022-12-15', `jadwalTime` = '06:34'
WHERE `jadwalID` IS NULL

    public function deleteJadwal($id){
        $query = $this->db->table('jadwal')->delete(array('jadwalID' => $id));
---
DELETE FROM `jadwal`
WHERE `jadwalID` = '21'