app/Models/MMataKuliah.php

SELECT *
FROM `matkul`
ORDER BY `matKulID` DESC
---
    public function getMatKul($id = false){
        if ($id === false){
            return $this->table('matkul')->orderBy('matKulID', 'DESC')->get();

SELECT *
FROM `dosen`
---
    public function getDosen(){
        $query = $this->db->table('dosen');
        return $query->get();